const array = [
  'Удосконалювати розвиток зв’язного мовлення \n Удосконалювати техніку читання, писемне мовлення та орфографічні навички.',
  '',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички. \n Удосконалювати обчислювальні навички та вміння розв’язувати задачі.',
  '',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички. \n Удосконалювати вміння розв’язувати задачі.',
  'Удосконалювати усне і писемне мовлення, орфографічні навички. \n  Удосконалювати вміння розв’язувати задачі.',
  '',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички. \n Удосконалювати вміння розв’язувати задачі.',
  '',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички. \n Удосконалювати обчислювальні навички та вміння розв’язувати задачі.',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички. \n Удосконалювати обчислювальні навички та вміння розв’язувати задачі.',
  'Удосконалювати розвиток зв’язного мовлення',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички. \n Удосконалювати обчислювальні навички та вміння розв’язувати задачі.',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички. \n Удосконалювати обчислювальні навички та вміння розв’язувати задачі.',
  'Удосконалювати розвиток зв’язного мовлення',
  'Удосконалювати усне і писемне мовлення, орфографічні навички.',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички. \n Удосконалювати обчислювальні навички та вміння розв’язувати задачі.',
  'Удосконалювати розвиток зв’язного мовлення',
  'Удосконалювати розвиток зв’язного мовлення',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички.',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички. \n Удосконалювати обчислювальні навички та вміння розв’язувати задачі.',
  '',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички.',
  'Удосконалювати техніку читання, писемне мовлення та орфографічні навички. \n Удосконалювати розвиток зв’язного мовлення',
];

const commonText = [
  {
    text: 'протокол №5 від 30.05.2025 р.',
    y: 389,
  },
  {
    text: 'В.о.директора Галина АНДРІЇШЕНА',
    x: 125,
    y: 168,
  },
  {
    text: 'Оксана САРЖЕНЮК',
    x: 125,
    y: 288,
    size: 8,
  },
];

const recArr = [
  {
    y: 342,
  },
  {
    y: 333,
  },
  {
    text: '',
    y: 323,
  },
];

const res = array.map((item) => {
  const recNewArr = item.split('\n').map((text, i) => ({
    text,
    ...recArr[i],
  }));

  return [...commonText, ...recNewArr];
});

console.log(res);
